not_now/fio/fio_disk/disk_xfs/log/RAID0/log_39/sdg/fio_randwrite_08k.log
test: (g=0): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=64
fio-3.1
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=6460: Tue Jul 24 18:38:03 2018
  write: IOPS=225, BW=1801KiB/s (1844kB/s)(1024MiB/582230msec)
    slat (usec): min=4, max=126, avg=27.49, stdev=10.15
    clat (usec): min=348, max=1478.9k, avg=284257.08, stdev=160236.01
     lat (usec): min=376, max=1478.9k, avg=284285.08, stdev=160237.97
    clat percentiles (msec):
     |  1.00th=[   16],  5.00th=[   29], 10.00th=[  109], 20.00th=[  171],
     | 30.00th=[  205], 40.00th=[  236], 50.00th=[  268], 60.00th=[  300],
     | 70.00th=[  334], 80.00th=[  376], 90.00th=[  460], 95.00th=[  592],
     | 99.00th=[  835], 99.50th=[  919], 99.90th=[ 1116], 99.95th=[ 1167],
     | 99.99th=[ 1301]
   bw (  KiB/s): min=   32, max= 4944, per=100.00%, avg=1814.37, stdev=509.19, samples=1155
   iops        : min=    4, max=  618, avg=226.79, stdev=63.65, samples=1155
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.08%, 20=2.38%, 50=4.84%
  lat (msec)   : 100=2.26%, 250=34.83%, 500=47.40%, 750=6.35%, 1000=1.58%
  lat (msec)   : 2000=0.25%
  cpu          : usr=0.27%, sys=0.92%, ctx=131062, majf=0, minf=477
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=0,131072,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=1801KiB/s (1844kB/s), 1801KiB/s-1801KiB/s (1844kB/s-1844kB/s), io=1024MiB (1074MB), run=582230-582230msec

Disk stats (read/write):
  sdg: ios=0/131037, merge=0/0, ticks=0/37256428, in_queue=37262031, util=100.00%